Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 윤시아 잉스타 봤어?
en_us: did you see sia’s instargram profile?

source: 뭐, 뭣!?
en_us: wh-what?!

source: 안녕하세요 오늘은 1일 1식 다이어트 식단
en_us: Hello! Today, I’ll share my meal plan for

source: 좋아하는 사람과 일상을 함께 하는 것만으로도…
en_us: I didn’t know that just enjoying my normal routine with the person I like...

source: 이게 일주일동안 했던 식단이라 이거지?
en_us: so this was his meal plan for the week?

source: 근데 강보배가 왜 '듀'야?
en_us: but why is bobae a dooh girl?

source: 반복적이고 지루하잖아!
en_us: it’s too repetitive!

source: 난 처음에 나 놀리는 줄 알았어.
en_us: I thought he was teasing me at first.

source: 쩌저적
en_us: CRACK

source: 몰래 크리스마스에 데이트하다 포착된 윤시아-김민호
en_us: Sia Yoon and Minho Kim Spotted on a Christmas Date

source: 겨울 방학 특훈 시작!!!
en_us: winter vacation special training begins!!!

source: 그리고 우리는…
en_us: and we...

source: 으음?
en_us: hmmm?

source: 특훈...?
en_us: special training?

source: 기다리고 기다리던 시원이랑 데이트 하는 날!
en_us: ...I’m out on my long-awaited date with siwon!

source: 표고라면 사양라면
en_us: Mushroom Noodles Classic Noodles

source: 맛있겠다!!!
en_us: that looks so yummy!!!

source: 서울
en_us: Seoul

source: 어, 정류장이다.
en_us: oh, there’s the bus stop.

source: 내 남친 킹카 만들기 프로젝트!!!
en_us: a.k.a. my boyfriend’s makeover project!!!

source: 이거 뒤뜰로 오라고 적혀있는 거 같은데...
en_us: whoever wrote this mentioned the back yard.

source: 나 금방 쩔었다…
en_us: I totally nailed it just now...

source: 내가 변한 것 같대...
en_us: he said I changed...

source: 김민호 체중 중간 점검!?[내남친 킹카만들기]
en_us: Minho Kim’s Weigh-In!! | My Dud to Stud Boyfriend

source: 돼지…?
en_us: p-pig...?

source: 너처럼 정신산만한 애가?
en_us: from a scatterbrain like you?

source: 미친 놈아!!!
en_us: you moron!!!

source: 고작 4kg라니…
en_us: but I lost only nine pounds?

source: 나!?
en_us: ...is me?!

source: 헤헿~ 그치?
en_us: hehe, right?

source: 맹세코...!
en_us: I swear!

source: 오빠가 평소에도 자다가 깨서 이상한 잠꼬대를 하긴 했는데...
en_us: minho often gets up in the middle of the night and says weird things in his sleep,

source: 뭐, 뭐지?
en_us: wh-what’s going on?

source: 이 콘텐츠는 너무 식상하지 않아?
en_us: isn’t candid camera content kinda old?

source: 자, 그럼 다음 노래 ~
en_us: well, then. let’s sing the next song!

source: 오오~ 그렇긴 하네~
en_us: oooh! that’s true.

source: 뭘 할 수가 없어!!!
en_us: I can’t do anything!!!

source: 우리 꽃분이 남친 감으로 딱이구먼,
en_us: perfect as my daisy’s boyfriend!

source: 반 친구들한테 피해준다고...
en_us: ...and this disrupts other kids in the class.

source: 좋아하는 거 없냐고!!
en_us: don’t they like anything?!

source: 시아쨩…있잖아…
en_us: you know... sia-chan...

source: 제이유
en_us: J.U.

source: 애니 노래 대회에서 상도 여러 번 탔다구~
en_us: he even won several anime song competitions!

source: 크리스마스에…!!
en_us: ...on christmas of all days?!

source: 현재.
en_us: now.

source: 이제 뭐할래?
en_us: what do you wanna do now?

source: 삼촌이랑 아빠가 샤브샤브 만들었다고 일찍 들어오래.
en_us: uncle and dad told us to come home early. they made shabu shabu.

source: 부촌역 로데오거리
en_us: Bu-Chon Station Rodeo Street

source: 하암~
en_us: YAWN

source: 어서 서둘러야 해!!
en_us: hurry, minho, hurry!!!

source: 다이어트 한다고 고생하는구먼~
en_us: being on a diet is hard, huh?

source: 내 의견은?
en_us: what about my opinion?

source: 나코나코니 세티아게루~ (나코 나코 하게 해줄게)
en_us: nako-nako-ni shite-agehru~ (like nako-nako)

source: 그냥 저질러보자는 생각 뿐이었거든.
en_us: so... I just decided there’d be nothing to lose by trying.

source: 꽃분이의 어릴 적 친구를 다시 보게 될 줄은 몰랐지.
en_us: I certainly didn’t expect to see daisy’s childhood friend like this.

source: 조잘 조잘
en_us: CHATTER CHATTER

source: 그,그래…
en_us: o-okay...

source: 텅~
en_us: EMPTY

source: 민호 전학간다고 꽃분이가 얼마나 울었는지~
en_us: daisy cried sooo much when you moved, minho.

source: 좀 설레?
en_us: does he make you nervous?

source: 어떡하지...
en_us: oh no...

source: 매일같이 똑같은 식단과 똑같은 운동을 유지하다 보니
en_us: since you’ve been maintaining the same diet and the same workouts every day...

source: 뭐어~?!
en_us: what?!

source: 나 좋다며!
en_us: plus, he said he liked me!

source: 몸무게도 벌써 80kg대로 내려왔고,
en_us: he’s below 200 pounds now for good.

source: 뭐해!
en_us: come on!

source: 그래, 가자.
en_us: fine. let’s go.

source: 큰 돈을 벌어서 우리 가족 다 같이…
en_us: I have to earn a lot of money so my whole family...

source: 슬금 슬금
en_us: STAMMER

source: 빨리 좁아터진 우리 집에서 벗어나고 싶기도 하고...
en_us: ..but I want to move out of my tiny place asap.

source: 그, 그게 뭔데~!!!
en_us: wh-what’s bmi?!!!

source: 빰
en_us: BAM

source: 그, 그래...?
en_us: r-real...ly?

source: 살이 안 찌는 데는 이유가 있구나...
en_us: so that’s why you don’t gain weight...

source: 뷰티 콘텐츠를 다루는 10대 남성 중 가장 큰 인기를 끌고 있다.
en_us: he’s the most popular of all teenage boys who focus on beauty content.

source: 그래도 어쩌겠어, 같이 하기로 한 건데.
en_us: but what can I do? I agreed to do this with you after all.

source: 에… 정말 변화를 주기만 해도 살이 다시 빠지는 거지…?
en_us: uh... just changing a few things can really make me lose weight again?

source: 있으면
en_us: have

source: 쿵 쿵 쿵
en_us: THUD THUD THUD

source: 이용해 주세요
en_us: Please use

source: 32만 8천원입니다~
en_us: your total is 328 dollars.

source: 백시원이 나랑 더 할 얘기가 있는 건가...?
en_us: ...does siwon still have something to say to me?

source: 뭐 하는 거야!
en_us: what do you mean?

source: 돼지라니~ 아냐!!
en_us: a pig? no way!!!

source: 넌 이걸 2개월 동안 어떻게 했냐?
en_us: how’d you do this for two whole months?

source: 친구 중에 이 방면에 대해 엄청 잘 알고 있는 애가 있거든!
en_us: I have a friend who is very well-versed in this area!

source: 고멘네 시아쨩!!!!!!!!!!
en_us: gomene (sorry) sia-chan!!!!!!!!!!

source: 기한이 되었는데도 아직
en_us: the ad was supposed to

source: 아, 벌써 점심 때야?
en_us: oh, it’s already lunchtime?

source: 이 맛있는 냄새…!!
en_us: this smells... so good!!!

source: 운영시간
en_us: Open Hours

source: 아니, 별건 아니고~
en_us: oh, I just...

source: 시아가 안 좋아할 것 같은데...
en_us: I don’t think sia will like that...

source: 와아...
en_us: wooow...

source: 귀여웠는데...
en_us: it was cute though...

source: 제목 가수 가사 국가별
en_us: Title Artist Lyrics Country

source: 너 지금 바로 씻어야겠다!!
en_us: go take a shower right now!

source: 나 혼자서 구독자 100만 만들어서 백시원 배아프게 만들어 줄테니까!
en_us: I’m gonna hit a million subscribers without siwon, them make him burn with jealousy!

source: 오타쿠들 진짜 골 때린다~ ㅋㅋㅋㅋ
en_us: those geeks are something, huh? bahaha!

source: 다음날
en_us: the next day

source: 꽃분이는 내 첫사랑이 되었다.
en_us: ...daisy became my first love.

source: 딩동 댕동
en_us: RRRRING

source: 가지마!!!
en_us: don’t go!!!

source: 윤시아는 더욱 더 적극적으로 민호를 설득(?)하기 시작했다.
en_us: ...sia did everything she could to win minho over.

source: 안 아까워?
en_us: doesn’t all that effort mean anything to you?

source: 가르쳐야 할 게 많지?
en_us: we have a long way to go...

source: 오늘 크리스마스 이브니까...
en_us: ...because it’s christmas eve today.

source: 너무해 흐이잉
en_us: why...? boohoo!

source: 전신 유산소
en_us: Full Body Workout

source: UV
en_us: UV SANITATION

source: 그런데 오늘, 우리의 옛날 모습을 보고...
en_us: but today, after reminiscing on when we were younger...

source: 이대로 포기할 수 없어...
en_us: I can’t just give up like this...

source: 이상하다~ 최만식이 너 체력 좋아졌다던데, 생각보다 별론데?
en_us: how strange. mansik said you got stronger! he must’ve been bluffing!

source: 그야 그 ㄴ이 맨날 내 성질을 긁으니까 그렇지!
en_us: that’s because she’s always provoking me!

source: 그럼 다음에 또 봐, 민하야~
en_us: see you next time, minha!

source: 꺄아
en_us: KYAHHH

source: 그렇다면...
en_us: then...

source: 실제로도 굶으니까 살이 많이 빠지기도 했고…
en_us: especially since I did lose a lot of weight that way...

source: 한 번 확인해봐~
en_us: go check on her!

source: 솔직히 그래야 급이 맞지.
en_us: honestly, we’re a better fit for each other.

source: 힐끔 힐끔
en_us: PEEK PEEK

source: 이게 프로젝트 시작 전의 너고,
en_us: look, this was you before we started the project.

source: -마..마감~~~~~~ -
en_us: -all... done!

source: 어디 가는데?
en_us: where are we going?

source: 윤시아도 이제 네 매력에 푹 빠져버린 거지!!!
en_us: sia must be totally into u now!!!

source: 오늘은 시험기간 브이로그를 찍으려 해요~!
en_us: I’m filming a midterm vlog!

source: 뭐어어!?
en_us: whaaaat?!

source: 사실 난…
en_us: to be honest...

source: 꺄아~ 시원아앙!!
en_us: kyahhh! siwonnn!!!

source: 난 딸기우유 먹을게.
en_us: I want strawberry milk.

source: 1kg나 빠졌다니~ 대단하다~!!
en_us: you lost another couple pounds! so amazing!!!

source: 그것도 현실 여자를...!?
en_us: a girl in the real world?!

source: 부동산
en_us: Realty

source: 그렇다면 가서 전해.
en_us: go tell her.

source: 네 여동생?
en_us: your younger sister?

source: 두 번째, 머리 손질
en_us: second, hair.

source: 내가 너 뭘 믿고 얼짱으로 만드냐?
en_us: how would I know whether you’ll really end up as a hunk or not?

source: 질질질
en_us: DRAG DRAG DRAG

source: 강보배!!
en_us: bobae kang!!!

source: 우리는 둘도 없는 친구가 되었다.
en_us: ...but we still became best friends.

source: <큐-브 몬스터>라는 건 말이다!{j}그냥 아동 만화가 아니란 말야!
en_us: you see, cube monster isn’t just a cartoon for kids!{j}

source: 마지막으로 눈 밑 매력점 그리기!
en_us: finally, a beauty spot under each eye!

source: 널 닮은 눈동자는
en_us: these eyes that remind me of you are~

source: 뭐, 뭐가?
en_us: h-have wh-what?

source: 어머어머, 얘 좀 봐~ 누가 너 오타쿠인 거 모르니?
en_us: hahaha, come on! I already know you’re an otaku!

source: 정신차리자, 김민호!!!
en_us: get your act together, minho!!!

source: 나 게임중이지~
en_us: I’m gaming!

source: 시원이 넌 마스크가 좋으니까~ 내가 기대가 커~!!
en_us: with such a good face, I look forward to what you can achieve, siwon!!!

source: 1000원이여유~
en_us: that’ll be one buck!

source: 뭐냐?
en_us: what are you...

source: 스윽...
en_us: TRUDGE

source: 저, 저 녀석...
en_us: h-he’s...

source: 김민호가 이렇게까지 뜨거운 반응을 얻고 있는 이유는…
en_us: the reason why minho was getting so much attention...

source: 이렇게 행복할 수 있구나 싶더라구.
en_us: ...could make me so happy.

source: 이번 크리스마스에 혼자 보내게 됐다며!
en_us: that you’re spending christmas alone this year!

source: 갑자기 열심히 하네?
en_us: you’re suddenly putting your all into it.

source: 생각보다 재미있어,
en_us: it’s a lot more fun than I thought.

source: 고오오오
en_us: LOOM

source: 용맹한 모습이 특히!!!
en_us: and she’s brave, too!!!

source: 진안
en_us: Jin An

source: 히에엑!!
en_us: eeep!!!

source: 샤라랑~
en_us: BLING

source: 치킨의 진수 번(데기) 참치
en_us: Fried Chicken Beondegi Tuna

source: 배불러…더는 못 먹어…
en_us: I’m full... I can’t eat any more...

source: 으악!!!
en_us: aack!!!

source: 와… 우와~!
en_us: w-wow...!

source: 제법…봐줄 만해진 듯하다!
en_us: ...actually started looking a lot better!

source: 내 장난감 발견
en_us: I found my toy!

source: 안돼에에에!!!!
en_us: noooo!!!!

source: 야, 최만식!!!
en_us: hey, mansik choi!!!

source: 그, 그럼 내가 점심 차려도 될까?
en_us: th-then can I make lunch for you?

source: 천하의 윤시아가 크리스마스를 잊고 있었다니!!!
en_us: sia yoon, of all people, forgot that it was christmas!!!

source: 그래, 둘이 사귀고 싶으면 사귀어!
en_us: fine. if you want to date each other, go ahead!

source: 작사 원미동어흥이
en_us: Lyrics: WantMeRoar

source: 찐 금수저인 우리 보배는 못 이기지!
en_us: she’s no match for a real woman of means like you!

source: 봐!
en_us: see?

source: 괜히 이효주 말에 혹해서...
en_us: I should have ignored hyoju!

source: 긁지 않은 복권?
en_us: a hidden gem?

source: 그, 그런 거 아니거든!
en_us: I-I thought it through!

source: 쌔앵
en_us: ZOOM

source: 오늘 한껏 꾸민 거구나...
en_us: ...everyone was so dressed up today.

source: 잠결에 라면을 끓여 먹다니...
en_us: who knew he’d make instant noodles in his sleep...?

source: 으음~
en_us: mmm!!!

source: 제발!!
en_us: pleeease!!!

source: 그럼 시원아, 시험 기간 끝나면...
en_us: then, after the exams are over...

source: 미도 B
en_us: MIDO B

source: 별로 놀지도 못 했는데~
en_us: but we didn’t get to hang out much.

source: 둘...!
en_us: two...!

source: 갈아타든 말든 난 신경 안 써!
en_us: I don’t care whether you start dating another girl or not!

source: 기분 탓인가...?
en_us: or am I imagining it?

source: 으아아아!!
en_us: aaaargh!!!

source: 그런 일이 있었구나…
en_us: so that’s what happened...

source: 일어나!!
en_us: get up!!!

source: 이대로 가다가 빼빼로 되는 거 아니야!?
en_us: you’ll become really skinny super fast at this rate!

source: 자, 그럼 저녁 준비 될 때까지 쉬고 있거라.
en_us: well then, you all can rest while I finish preparing dinner.

source: 저기, 금방도 말 했지만 나 이벤트 보상을 받아야해서...
en_us: um, like I said... I have to win the special holiday rewards...

source: 매일 똑같은 일상에서,
en_us: although every day was the same...

source: 김민호가 좋아하는 거…
en_us: what does...

source: 우리 결별 소식은 학교 뿐만이 아니라,
en_us: news of our breakup spread beyond school...

source: 내가 SNS에서 유명해진 이유는 외모 때문만은 아니었다.
en_us: my cute looks weren’t the only reason I became famous on social media.

source: 자, 잠깐만...
en_us: w-wait...

source: 러닝머신 타는 거...
en_us: the treadmill...

source: 에..에엣!?
en_us: h-huh?!

source: 그게 꾸민 거 였다고…?
en_us: you... dressed up?

source: 재미있을 것 같아!
en_us: but it seems like fun!

source: 이번엔 2주 후에 잴테니까 열심히 해보자!
en_us: your next weigh-in will be in two weeks, so let’s keep up the good work!

source: 1일 1식 다이어트 식단
en_us: One Meal a Day Diet: Meal Plan

source: 얘 때문에 DM 폭탄이라고!!!
en_us: I’m being bombarded with dms because of him!!!

source: 네가 그때 그 김민호다 이거지...
en_us: you’re minho kim from back then, huh?

source: 알람 10:30
en_us: Alarm 10:30

source: 운동도 빡세게 했으니까
en_us: ...and exercised really hard.

source: 그, 그럼 우리 오늘 데이트 한 거잖아!!
en_us: s-so this is a date!!!

source: 김진완 3개월 전
en_us: Jinwan Kim 3 months ago

source: 뚜둑 뚜둑
en_us: CRACK CRACK

source: 잘 갔다와~
en_us: enjoy your workout!

source: 감내할 수 있겠나!!?
en_us: can you handle it,

source: 그게 아니라...
en_us: no...

source: 우린 친구야!!
en_us: we’re just friends!!!

source: 데이트인거지?
en_us: ...a date, right?

source: 오짬 헐랭 윤시아 돌아왔다 대박
en_us: ohsogood woot! sia’s back! awesome!

source: 우, 우왓!!!
en_us: wh-whoaaa!!!

source: 스노우 3개월 전
en_us: snow 3 months ago

source: 아빠, 얘 이름 듣고도 누군지 모르겠어?
en_us: dad, you don’t recognize him? even after hearing his name?

source: 너 전에 윤시아한테 맞아서 이빨 빠진 건 괜찮냐?
en_us: you even lost a tooth because sia kicked you.

source: 나도 할 수 있어!!!
en_us: ...is something I can do!!!

source: 물론이지, 엄청 빠졌을걸~?
en_us: of course! I probably lost a ton of weight!

source: 테스트 촬영이 이정도면 나중엔 얼마나 잘 하려고 그래~
en_us: your test shots came out great. how much better do you plan to be later on? haha.

source: 말도 안 돼!!!
en_us: no way!!!

source: 오성환(14)
en_us: seonghwan oh (14)

source: 5kg가 빠져도 모자랄 판에 왜 3kg나 더 찐 거냐고!!
en_us: you should’ve lost at least ten pounds! why did you gain five more instead?!

source: 꾸리 꾸리
en_us: STINKY STINKY

source: 3kg
en_us: + 5 lbs

source: 으아, 진짜 배부르다.
en_us: ugh... I’m so full.

source: 시간도 꽤 남았는데...
en_us: we still have a lot of time...

source: 헤헷, 집 가서 팬카페에 후기 써야징~
en_us: hehe, I’m going to write a review in the forums when I get home.

source: 와… 와아~
en_us: w...ow...

source: 깔끔함의 대명사 미니멀룩!
en_us: an iconic minimal look!

source: 너 많이 먹어...
en_us: thanks... you too...

source: 더 놀라운 것은…
en_us: what was more surprising, though...

source: 아오...
en_us: ugh...

source: 뭐 그런거요ㅎㅎ
en_us: someone like that, hehe.

source: 건욱 사거리 도착 예정 버스
en_us: Buses arriving at Geonuk Intersection

source: 왜애~ 한 번 쯤은 괜찮잖아~
en_us: awww, come on, siwon! just once won’t hurt, right?

source: 뭐야, 벌써 지친 거야?
en_us: what? you’re already tired?

source: ...없어.
en_us: ...can’t have it.

source: 먹었어...
en_us: I ate...

source: 또 유광패딩에다가…
en_us: in a shiny down jacket?

source: 헤에~
en_us: HEHE

source: 그…그래?
en_us: r-really?

source: 가, 같이 가!
en_us: w-wait for me!

source: 다음에 또 와줘~
en_us: come again, okay?

source: 음… 그냥~
en_us: hm... just because.

source: 너 살 빠질 때까지 이 식단 유지할 거야!!!
en_us: you can’t have anything other than what’s on the meal plan until you lose weight!!!

source: 그렇게 잠적하더니 가져온 게 고작 내남친 킹카만들기?
en_us: was that all she could think of during her break? my dud to stud boyfriend?

source: 그런가…
en_us: is it?

source: 올~
en_us: WHOA

source: 시아쨩도 노래 엄청 잘하던걸?
en_us: sia-chan, you sing really well too!

source: 우와앙~
en_us: WOOOW

source: 뭐, 뭐야…?
en_us: wh-what the heck...?

source: 시아쨩이 말한 뷰티 뉴튜버가 설마...
en_us: is he... the beauty newtuber you mentioned?

source: 상처…
en_us: HURT

source: 역은행365
en_us: Bank 365

source: 아직은 잘...
en_us: I’m not sure yet...

source: 역시 난 귀여워!!!
en_us: yes! I’m cute!!!

source: 무려 첫사랑이야...
en_us: she’s my first love...

source: 아참, 너희들 곧 50만이라며?
en_us: oh, right! you guys are hitting half a million subscribers soon, right?

source: 만식쿤?
en_us: mansik-kun?

source: 아요 5527개
en_us: 5527 likes

source: 얏타!!
en_us: yatta*!!! *”hooray” in Japanese

source: 이거 이거, 아주 상습범이구먼!?
en_us: you’re a habitual offender, aren’t you?!

source: 그, 그건 그렇지만...
en_us: t-true... but...

source: 그, 그렇다면...
en_us: th-then...

source: 그때부터 민호는...
en_us: from that moment on...

source: 자, 잠깐!!
en_us: w-wait!

source: 네 말대로 하는 것도 뭐...
en_us: your suggestion...

source: 안녕하십니까!
en_us: hello!

source: 걱정이 되기도 하구요.
en_us: it kind of worries me.

source: 너 똑바로 세야 한다.
en_us: count properly, okay?

source: 나도 기분 상했어!
en_us: I’m offended!

source: 체중
en_us: Weight lbs 192

source: 한 번에 데이트 수락이라니!
en_us: in one go, at that!

source: 탁 탁 탁 탁
en_us: TAP TAP TAP TAP

source: ㅋㅋㅋ 퍽!
en_us: HAHAHA WHACK

source: 성환쿤은 또 누구야...
en_us: who the heck is seonghwan-kun?

source: 구독자 12.8만 뷰티 유튜버
en_us: beauty newtuber with 128k subscribers

source: 딱 그 타이밍이 왔구먼.
en_us: this is the perfect time to do that.

source: 그래,
en_us: well...

source: 3주 좋아요 답글달기
en_us: 3 weeks ago LIke Reply

source: 네...?
en_us: huh?

source: 수다를 떨며 걷는 동네 아주머니들,
en_us: the women in the neighborhood meet up to chat.

source: 봐주고 있었구나, 쑥쓰럽네.
en_us: it’s a bit embarrassing, but thanks for watching.

source: 룸투어 영상은 커녕 친구도 못 데려왔어.
en_us: so I never brought anyone over and can’t film a room tour.

source: 앗, 미안.
en_us: oh, sorry.

source: 슬쩍
en_us: GLANCE

source: 왜 더이상 살이 쭉쭉 빠지지 않는 거야!!!
en_us: so why am I not losing weight fast anymore?!!!

source: 뭐야...
en_us: no.

source: 헐
en_us: NO WAY

source: 휴대전화
en_us: Mobile

source: 이렇게 삼시세끼 다 챙겨먹어도 되는 거 맞아…?
en_us: is it really okay for me to eat all three meals a day?

source: 윤시아
en_us: sia yoon

source: 오래 전부터...?
en_us: a long time ago?

source: 시아루~ 윤시아입니다.
en_us: hey, sialoves! sia here.

source: 빨랑 문 안 열어!?
en_us: why aren’t you opening the door?!

source: 이번에 올린 잉스타…
en_us: the last instar post...

source: 귀여운 스타일이 찰떡으로 잘 어울리네…
en_us: cute outfits suit him really well...

source: 코믹 행사도 아주 많이 열린다구!
en_us: there are tons of comic expos too!

source: 맛있는 먹거리들도
en_us: ...the more heavenly foods...

source: 히이이이이익!!!!!
en_us: eeeeeek!!!

source: 그냥 헤어져.
en_us: it’s over.

source: 뭔가 좀 아쉬운데...
en_us: something about this doesn’t look right...

source: 으, 으응!!
en_us: o-okay!

source: 히엑!
en_us: gasp!

source: 샤이닝 스타!
en_us: shining star!

source: 진심으로 응원하고 있습니다, 형님!!
en_us: I’m sincerely rooting for you!

source: 아이고~!!
en_us: oh, geez!!

source: 1월 전세계
en_us: In theaters worldwide this January!

source: 확실히 민호의 교복바지가 널널해지기 시작했고,
en_us: in fact, minho’s pants were now a bit loose...

source: 식단도 그대로 지켰고,
en_us: he followed the meal plan exactly as is...

source: 시, 시아쨩… 돈이 어디서 나서 이렇게 비싼 옷들을 사준 거야…
en_us: s-sia-chan... how can you afford to buy me such expensive clothes?!

source: 이벤트 USB
en_us: Event USB

source: 히..히익..
en_us: o-oh...

source: 뭐야, 너 왜 여깄냐.
en_us: why are you here?

source: 다이어트라는 거…
en_us: dieting...

source: 쿨쿨
en_us: ZZZ ZZZ

source: 후…
en_us: PHEW

source: 김밥천사
en_us: KIMBAB ANGEL

source: 너랑 그녀는 레벨 자체가 달라.
en_us: she’s on a whole different playing field.

source: 어, 비온다.
en_us: hey, it’s raining.

source: 어쩌긴 뭘 어째, 니들 동영상 찍는 거 다 봤거든?
en_us: what do you think? I saw you two filming everything.

source: 큐브 몬스터라면…그 미미쨩?
en_us: cube monster? the anime with...

source: 3년 오덕인생 최대난제라구!!!!
en_us: this is the biggest dilemma I’ve faced in my entire three years of being an otaku!!!!

source: 그랬구나…!!
en_us: I see!

source: 실내 흡연
en_us: Smoking indoors

source: 왜냐니...!!
en_us: what?!

source: 내가 치킨이랑 탕수육 먹으려고 얼마나 참았는데...!!
en_us: I endured so much to have fried chicken and sweet and sour pork today!!!

source: 시키는 대로 했을 뿐야!!
en_us: I followed every one of your instructions!!!

source: 대단하네~
en_us: that’s great.

source: 나 더는 못 뛰어…!!
en_us: I can’t run anymore...!!!

source: 얘...
en_us: she’s....

source: 오늘 좀 괜찮은데?
en_us: ...looks pretty good today!

source: 전형적인 가오 허세충들로,
en_us: they’re huge bluffers...

source: 시시커플이 헤어지다니......
en_us: This can’t be real...

source: 11화
en_us: Episode 11

source: 꽃미남이 되는 걸까...?
en_us: become a real stud...?

source: 뭔데요?
en_us: what is it?

source: 킹카...만들기 프로젝트?
en_us: dud... to stud?

source: 토나리도오시 아나따또~
en_us: tonaridowoshi anattado~

source: 위로를 해주곤 있지만…
en_us: although she was trying to comfort him...

source: 5정류장 전
en_us: 5 stops away

source: 왜!!!
en_us: so why?!!!

source: 쳇
en_us: HMPH

source: 맞다, 그렇지!!
en_us: you’re right!!!

source: 으응…
en_us: okay...

source: 보배야, 귀담아 듣지마!
en_us: exposed? you? no way!

source: 섯끼츄의 역습
en_us: Setkichu’s Revenge

source: 아이돌 패션!
en_us: kpop idol fashion!

source: 매점이나 가자구~
en_us: let’s go to the store!

source: 꺄아아아
en_us: KYAAA

source: 우선 이걸 받아.
en_us: first, take this.

source: 언니가 밥 거르지말고 잘 챙겨 먹으라고 했거든!?
en_us: sia said you can’t skip any meals!!!

source: 전세계 동시개봉!
en_us: In theaters worldwide this January!

source: 한!곡!더!
en_us: Sing one more!

source: 보는 눈이 있다니까!
en_us: you know what’s good!

source: 윤시아 진짜 뜨고 싶나봐~
en_us: sia must really want to be a star!

source: 무서워...!!!
en_us: this is scary!!!

source: 요싯!
en_us: yosh!

source: 영화관에서 이래도 돼!?
en_us: is this allowed in movie theaters?!

source: 바들바들바들바들
en_us: WOBBLEWOBBLEWOBBLE

source: 철퍽 철퍽
en_us: SPIT SPIT

source: 호에에...
en_us: wha...?

source: 네 말은...
en_us: ...you’re saying...

source: SNS 스타니 뭐니 한다면서 바로 개명을 해버렸지 뭐니…
en_us: when she decided to be a social media star or whatever, she changed her name...

source: 그렇게 3주가 흐르고...
en_us: three weeks later...

source: 시아의 곁에 있고 싶어!
en_us: I want to stand by sia’s side!

source: 이번 시즌에선 나코짱이 메인 주인공 자리를 차-지 했다고!
en_us: nako-chan is the main character in this season!

source: 인기가 많던 시절
en_us: when she used to be more popular

source: 너 무시하던 놈들 입이 떠억 벌어지게 만들고 싶지 않냐구!
en_us: wouldn’t it be nice to get back at all the kids who looked down on you?!

source: 배…
en_us: I’m...

source: 최만식 저 녀석 뭔가 무섭단 말이지~!!!
en_us: something about mansik scares meee!!!

source: 상종을 하지 말아야지.
en_us: I should just ignore them.

source: 시간 없어!
en_us: we don’t have much time!

source: 110.2kg
en_us: 243.1 lbs

source: 꽤 덥수룩하다?
en_us: it’s pretty long.

source: 라면 그 걸그룹 멤버?
en_us: the one in that girl group?

source: 실내 흡연시 퇴실조치 합니다
en_us: Smoking indoors will get you kicked out.

source: 이게...
en_us: what the heck...

source: 한 번만 더 김민호 건드려 봐,
en_us: if you try anything funny with minho again...

source: 프로젝트는 갑자기 왜 하겠다고 한 거야?
en_us: why did you suddenly want to join the project?

source: 가정방문...!
en_us: ...a home visit!

source: 큭...
en_us: ergh...

source: 아오, ㅆㅂ!
en_us: ugh, dammit!

source: 뷰티 뉴튜버면 메이크업만 하는 거 아니야?
en_us: then, doesn’t that mean your friend only does makeup?

source: 그니까~ 이렇게 영원히 못 볼 줄 알았어!
en_us: I know, right? I thought we’d never get back in touch!

source: 맞아, 그러고보니 그 아이는...!!!
en_us: oh, right. now that I think about it...

source: 은행 연구소 헌혈의 성
en_us: Bank Center Blood Donations

source: 이게 계속 놀아주니까 덤비고 있어!!
en_us: you’re not allowed to talk back to me!!!

source: 혹시 이름이..!
en_us: what’s your name?

source: 그냥 마구 즐기면 되는 것이다!!!
en_us: just enjoy yourself! that’s all you need to do!!!

source: 풋!
en_us: pfft!

source: 오빠, 저녁 안 먹어도 돼?
en_us: minho, you’re not going to have dinner?

source: 그런데 너...
en_us: hey, minho...

source: 잉?
en_us: huh?

source: 며칠 전부터 김민호는
en_us: ...several days ago...

source: 시아쨩이 시간을 꼭 빼놓으라고 말 했어...
en_us: but sia-chan told me to keep my schedule open for it.

source: 난 시아쨩이 생각한 만큼 용기 있는 사람이 아닌가봐...
en_us: I don’t think I’m brave enough...

source: 보는 사람도 없잖아…
en_us: no one’s watching...

source: 조회수 25만 1일 전 #내남친킹카만들기 #윤시아
en_us: 250K views 1 day ago #dudtostudboyfriend #siayoon

source: 야, 내가 언제 그랬냐!?
en_us: when did I ever do that?!

source: 먹다가 방치한 컵라면 무덤도 치우고!!
en_us: and clean up this mountain of half-eaten instant noodle cups!!!

source: 맞아, 분명 내가 기억하는 민호는 그랬는데...
en_us: yes, that is the minho I remember...

source: 부럽다...
en_us: I’m jealous...

source: 말을 말자~
en_us: forget it...

source: 시아쨩도 해줬으니 나도 꼭 해주고 싶어…!!!
en_us: since you gave me a present, I want to give you something too, sia-chan!!!

source: 밍쯔네
en_us: MIN’S

source: @@ 두 눈을 의심..
en_us: The SISI Couple is over???

source: 집에 도착하면 만식이의 홈트레이닝 영상을 반복 재생하며
en_us: when he got home, he turned on mansik’s home workout videos...
